DELETE_QUESTION_CONFIRM = """
آیا از حذف این سوال مطمئن هستید؟

📌 شما میتوانید این فرآیند را کنسل (/cancel) کنید.
📌 با حذف این سوال تمام فایل های پیوست شده به آن نیز حذف میشوند.
📌 دیگر امکان پاسخگویی به این سوال وجود نخواهد داشت.
"""

DELETE_QUESTION_YES_BUTTON = "بله این سوال را حذف کن"

DELETE_QUESTION_NO_BUTTON = "خیر از حذف کردن منصرف شدم"

DELETE_QUESTION_CANCELED = "حذف سوال توسط شما کنسل شد."

DELETE_QUESTION_SUCCESSFUL = "✅ سوال مورد نظر شما با موفقیت حذف شد."

YOUR_QUESTION_DELETED = """
متاسفانه سوال شما با مشخصات زیر توسط یکی از ادمین های ما حذف شده و دیگر به آن پاسخ داده نخواهد شد 😟.

عنوان: **{}**
درس: **{}**
"""
