ATTACHMENT_NOT_FOUND = """
متاسفانه ما همچین پیوستی را پیدا نکردیم 🤷‍♂️.
ممکن است مشکلی رخ داده باشد یا این پیوست قبلا حذف شده باشد.
لطفا داده های خود را به روزرسانی کنید.
"""

CAN_NOT_DELETE_OTHERS_ATTACHMENT = """
شما ادمین نیستید و نمیتوانید پیوست های دیگران را حذف کنید 🚫.
لطفا داده های خود را به روزرسانی کنید.
"""

DELETE_ATTACHMENT_CONFIRM = "آیا از حذف این پیوست مطمئن هستید؟"

DELETE_ATTACHMENT_YES_BUTTON = "بله این پیوست را حذف کن"

DELETE_ATTACHMENT_NO_BUTTON = "خیر پیوست را حذف نکن."

DELETE_ATTACHMENT_CANCELED = "حذف پیوست سوال توسط شما کنسل شد."

DELETE_ATTACHMENT_SUCCESSFUL = "✅ پیوست مورد نظر شما با موفقیت از سوال مربوطه حذف شد."

SEND_DELETE_ATTACHMENT_REASON = """
لطفا علت خود را برای حذف این پیوست ارسال کنید.

📌 شما میتوانید این فرآیند را کنسل (/cancel) کنید.
📌 ما علت ارسال شده ی شما را به همراه یک پیام برای کاربر مورد نظر ارسال میکنیم تا از حذف شدن پیوست سوال مطلع شود.
"""

NO_EMPTY_REASON = """
علت حذف پیوست نمیتواند خالی باشد.
لطفا مجدد علت حذف این پیوست از سوال را ارسال کنید:
"""

REASON_SKIPPED = "علتی برای حذف پیوست شما توسط ادمین ارائه نشده است."

YOUR_ATTACHMENT_DELETED = """
❗ متاسفانه یک پیوست از سوال شما توسط ادمین های ما حذف شده است.

عنوان سوال: **{}**

علت حذف این پیوست:
**{}**

اگر در حذف این پیوست اشتباهی رخ داده است لطفا با ادمین های ما در تماس باشید ☎️.
"""
