ATTACHMENT_NOT_FOUND = """
متاسفانه ما همچین پیوستی را پیدا نکردیم 🤷‍♂️.
ممکن است مشکلی رخ داده باشد یا این پیوست قبلا حذف شده باشد.
لطفا داده های خود را به روزرسانی کنید.

⚠️ در صورتی که سوالی حذف شده باشد پیوست های آن نیز به طور خودکار حذف میشوند.
"""

DELETE_ATTACHMENT_CONFIRM = "آیا از حذف این پیوست مطمئن هستید؟"

DELETE_ATTACHMENT_YES_BUTTON = "✅ پیوست را حذف کن"

DELETE_ATTACHMENT_NO_BUTTON = "❌ از حذف پیوست منصرف شدم"

DELETE_ATTACHMENT_CANCELED = "حذف پیوست سوال توسط شما کنسل شد."

DELETE_ATTACHMENT_SUCCESSFUL = "✅ پیوست مورد نظر شما با موفقیت از سوال مربوطه حذف شد."

SEND_DELETE_ATTACHMENT_REASON = """
لطفا علت خود را برای حذف این پیوست ارسال کنید.

⚠️ ما علت ارسال شده ی شما را به همراه یک پیام برای کاربر مورد نظر ارسال میکنیم تا از حذف شدن پیوست سوال مطلع شود.

📌 میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

NO_EMPTY_REASON = """
علت حذف پیوست نمیتواند خالی باشد.
لطفا مجدد علت حذف این پیوست از سوال را ارسال کنید:
"""

REASON_SKIPPED = "علتی برای حذف پیوست شما توسط ادمین ارائه نشده است."

YOUR_ATTACHMENT_DELETED = """
❗ متاسفانه یک پیوست از سوال شما توسط ادمین های ما حذف شده است.

عنوان سوال: **{}**

علت حذف این پیوست:
**{}**

اگر در حذف این پیوست اشتباهی رخ داده است لطفا با ادمین های ما در تماس باشید ☎️.
"""
