WELCOME_MESSAGE = """
سلام {}
به ربات ما خوش آمدید ❤️.
"""

HAS_ACCESS = """
شما دسترسی لازم برای استفاده از ربات را دارید.
"""

ACCOUNT_DEACTIVATED = """
متاسفانه اکانت شما توسط ادمین های ما غیرفعال شده است.
برای بررسی علت و فعال کردن اکانت با ادمین های ما در تماس باشید.
"""

SEND_FULL_NAME = """
برای استفاده از ربات لطفا نام و نام خانوادگی خود را وارد کنید:

📌 میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

FULL_NAME_WORDS_LIMIT = """
❌ نام کامل شما باید حداقل شامل **۲ کلمه** (نام و نام خانوادگی) باشد.

لطفا مجدد نام کامل خود را وارد کنید:
"""

FULL_NAME_LENGTH_LIMIT = """
❌ حداکثر تعداد کاراکتر مجاز برای نام و نام خانوادگی **{} کاراکتر** است.

لطفا مجدد نام کامل خود را وارد کنید:
"""

SHARE_YOUR_PHONE = """
لطفا شماره تلفن 📱 خود را با استفاده از دکمه زیر با ما به اشتراک بگذارید.
این کار صرفا جهت اهراز هویت شما است و شماره ی شما برای کسی به اشتراک گذاشته نمیشود.
میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

SHARE_PHONE_BUTTON = "فرستادن شماره ی من 📱"

CANCEL_ACCESS_PROCESS = """
فرآیند دسترسی به ربات را کنسل کردید.

📌 برای گرفتن دسترسی استفاده از ربات میتوانید مجدد آن را استارت (/start) کنید.
"""

SEND_PHONE_TO_ACCESS = "لطفا شماره تلفن خود را با استفاده از دکمه زیر به اشتراک بگذارید."

SEND_YOUR_PHONE_TO_ACCESS = "شما باید شماره تلفن اکانت خود را به اشتراک بگذارید!"

ACCESS_GRANTED = """
✅ دسترسی لازم برای استفاده از ربات را دریافت کردید.
اکنون میتوانید از تمام امکانات ربات استفاده کنید ❤️.
"""
