SEND_LESSON_TITLE = """
لطفا یک عنوان برای درس انتخاب کنید:

📌 شما میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

ADD_LESSON_CANCELED = "افزودن درس جدید کنسل شد."

NO_EMPTY_TITLE = """
❌ عنوان درس نمیتواند خالی باشد!

لطفا عنوان درس را مجدد ارسال کنید:
"""

TITLE_MAX_LENGTH = """
❌ حداکثر تعداد کاراکتر مجاز برای عنوان درس **{} کاراکتر** است.

لطفا عنوان درس را مجدد ارسال کنید:
"""

LESSON_TITLE_EXISTS = """
❌ درس مورد نظر اضافه نشد.

درسی با این عنوان از قبل وجود دارد (/lesson_detail_{}).
"""
