SEND_YOUR_ANSWERS = """
لطفا پاسخ هایی که میخواهید برای کاربر ارسال شود را بفرستید:

📌 شما میتوانید این فرآیند را کنسل (/cancel) کنید.
📌 حداکثر تعداد پیام برای پاسخ دادن به سوال **{} پیام** است.
📌 شما میتواند هرگونه فایل یا متنی را به عنوان پاسخ ارسال کنید و ما تمام آنها را مستقیما برای کاربر ارسال خواهیم کرد.
📌 پس از فرستادن پاسخ های خود با استفاده از دکمه زیر آنها را برای کاربر ارسال کنید
"""

SEND_ANSWER_DONE = "📤 ارسال پاسخ ها برای کاربر"

ANSWER_QUESTION_CANCELED = "پاسخ دادن به سوال کاربر توسط شما کنسل شد."

EMPTY_ANSWERS_LIST = """
🚨 شما هیچ پاسخی را برای ارسال به کاربر نفرستاده اید.
به همین علت فرآیند پاسخگویی به این سوال کنسل شد.
"""

ANSWER_NUMBERS_LIMIT = """
❗ پاسخ های شما به حداکثر تعداد پیام برای پاسخگویی به سوالات رسیده است.
پاسخ هایی که تا اینجا فرستاده اید را برای کاربر ارسال خواهیم کرد.
"""

WAIT_FOR_SEND_ANSWERS = "در حال ارسال پاسخ های شما به کاربر هستیم. لطفا منتظر باشید ⌛."

YOUR_QUESTION_ANSWERS = """
به سوال شما (/question_detail_{}) توسط یکی از ادمین های ما پاسخ داده شده.

عنوان سوال: **{}**
درس: **{}**

پاسخ سوال شما 👇
"""

USER_BLOCKED_BOT = """
⛔ متاسفانه کاربری که این سوال را پرسیده است ربات ما را بلاک کرده است.
پاسخ های شما برای کاربر مورد نظر ارسال نشد.
"""

SEND_ANSWER_SUCCESSFUL = "✅ پاسخ های شما با موفقیت به کاربر مورد نظر ارسال شد."
