USER_IS_DEACTIVE = """
این کاربر اکنون غیرفعال است.
لطفا داده های خود را به روزرسانی کنید.
"""

SEND_DEACTIVATION_REASON = """
لطفا دلیل خود را برای غیرفعال کردن کاربر بنویسید.
شما میتوانید این فرآیند را کنسل (/cancel) کنید.

❗ اگر کاربر ادمین باشد به یک کاربر معمولی تبدیل میشود.
❗ ما توضیحات شما را با یک پیام برای کاربر ارسال میکنیم.
❗ شما میتوانید با استفاده از دکمه زیر از این مرحله عبور کنید و ما علتی را برای کاربر ارسال نمیکنیم.
❗ بیشترین تعداد کاراکتر برای نوشتن علت **{}** کاراکتر است.
"""

DEACTIVE_USER_CANCELED = "شما فرآیند غیرفعال کردن کاربر را کنسل کردید."

NOT_EMPTY_REASON = "شما باید علتی برای غیرفعال کردن کاربر بنویسید یا با استفاده از دکمه ی زیر از این مرحله عبور کنید."

NO_REASON_PROVIDED = "علتی برای غیرفعال کردن اکانت شما ارائه نشده است."

ACCOUNT_DEACTIVATED_MESSAGE = """
متاسفانه اکانت شما توسط یکی از ادمین های ما غیرفعال شده است 😢.
به همین علت شما دیگر نمیتوانید تا فعال شدن مجدد اکانتتان از امکانات ربات استفاده کنید.

📋 علتی که برای غیرفعال کردن اکانت شما توسط ادمین ارائه شده:

**{}**

اگر مشکل یا اشتباهی رخ داده است لطفا با ادمین های ما در تماس باشید ☎️.
"""

USER_DEACTIVATED = """
کاربر مورد نظر با موفقیت غیرفعال شد.
این کاربر دیگر نمیتواند از امکانات ربات استفاده کند.
ما این موضوع را به کاربر اطلاع دادیم.
"""
