USER_IS_NOT_ADMIN = """
کاربر مورد نظر شما یک ادمین نیست.
لطفا داده های خود را به روزرسانی کنید.
"""

SEND_DOWNGRADE_REASON = """
لطفا علت خود را برای تبدیل ادمین به کاربر معمولی را بنویسید.
شما میتوانید این فرآیند را کنسل (/cancel) کنید.

❗ ما این علت را با یک پیام برای کاربر ارسال میکنیم.
❗ شما میتوانید با استفاده از دکمه زیر از این مرحله عبور کنید و ما علتی را برای کاربر نمیفرستیم.
❗ بیشترین تعداد کاراکتر برای نوشتن علت **{} کاراکتر** است.
"""

DOWNGRADE_ADMIN_CANCELED = "فرآیند تبدیل ادمین به کاربر معمولی کنسل شد."

DOWNGRADE_NOT_EMPTY_REASON = "شما باید علتی را برای تبدیل ادمین به کاربر معمولی بنویسید یا با استفاده از دکمه زیر از این مرحله عبور کنید."

DOWNGRADE_NO_REASON_PROVIDED = "علتی برای تبدیل شما به کاربر معمولی ارائه نشده است."

DOWNGRADED_TO_USER_MESSAGE = """
متاسفانه اکانت شما به کاربر معمولی تبدیل شده است 👤.
به همین علت شما دیگر نمیتوانید از امکانات ادمین ها استفاده کنید.

📋 علت ارائه شده برای تبدیل اکانت شما به کاربر معمولی:

**{}**

اگر مشکل یا اشتباهی رخ داده است لطفا با ادمین های ما در تماس باشید ☎️.
لطفا منوی اصلی (/main_menu) خود را به روزرسانی کنید.
"""

DOWNGRADE_ADMIN_SUCCESSFULLY = """
ادمین مورد نظر با موفقیت به کاربر معمولی تبدیل شد.
ما این موضوع را به کاربر اطلاع دادیم.
"""
