USER_IS_ADMIN = """
این کاربر اکنون یک ادمین است.
لطفا داده های خود را به روزرسانی کنید.
"""

UPGRADE_USER_CONFIRM = """
آیا مطمئن هستید که میخواهید این کاربر را به ادمین ارتقا دهید?

❗ این کاربر میتواند به تمام امکانات ادمین ها دسترسی داشته باشد.
❗ اگر کاربر غیرفعال باشد آن را فعال میکند.
"""

UPGRADE_USER_YES_BUTTON = "بله آن را ارتقا بده."

UPGRADE_USER_NO_BUTTON = "خیر ارتقا را کنسل کن."

UPGRADE_USER_CANCELED = "ارتقا کاربر به ادمین کنسل شد."

UPGRADED_TO_ADMIN_MESSAGE = """
اکانت شما به ادمین ارتقا داده شد 🗽.
اکنون شما میتوانید به امکانات ادمین ها نیز دسترسی داشته باشید.
لطفا به منوی اصلی (/main_menu) بروید تا گزینه های جدید را ببینید.
"""

UPGRADE_USER_SUCCESSFUL = "کاربر مورد نظر با موفقیت به ادمین ارتقا یافت."
