BOT_ERROR_OCCURED = """
متاسفانه هنگام اجرای درخواست شما مشکلی رخ داده است.
ما این مشکل را برای بررسی به ادمین ها گزارش داده ایم.
لطفا دوباره تلاش کنید ♥.
"""

ADMIN_ERROR_REPORT = """
Error occured in our bot:

command:
**{}**

error text:
**{}**
"""

YOU_ARE_NOT_USER = """
برای استفاده از این قابلیت شما باید کاربر ربات باشید.
لطفا /start را ارسال کنید تا به ربات دسترسی پیدا کنید.
"""

YOU_ARE_NOT_ADMIN = "برای استفاده از این قابلیت شما باید ادمین ربات باشید."

YOU_ARE_NOT_PROGRAMMER = "برای استفاده از این قابلیت شما باید برنامه نویس ربات باشید."
