EMPLTY_LESSONS_LIST = """
لیست درس های ارائه شده در این ربات خالی است.
برای طرح سوال ابتدا باید درس های قابل پاسخگویی توسط ادمین ها به ربات اضافه شود.
لطفا منتظر بمانید و بعدا مجدد تلاش کنید ❤️.
"""

SELECT_LESSON_PREFIX = "/select_lesson"

UNDEFILED_LESSON = "درس نامشخص"

SELECT_LESSON = "لطفا از لیست زیر یک درس را انتخاب کنید:"

CANCEL_SELECT = "❌ کنسل کردن"

ADD_QUESTION_CANCELED = "ثبت سوال جدید کنسل شد."

SEND_QUESTION_TITLE = """
لطفا یک عنوان برای سوال خود انتخاب کنید:

⚠️ حداکثر تعدا کاراکتر برای عنوان سوال **{} کاراکتر** است.

📌 میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

NO_EMPTY_TITLE = """
❌ عنوان سوال نمیتواند خالی باشد.

لطفا مجدد عنوان سوال را ارسال کنید:
"""

TITLE_LENGTH_LIMIT = """
❌ حداکثر تعدا کاراکتر برای عنوان سوال **{} کاراکتر** است.

لطفا مجدد عنوان سوال را ارسال کنید:
"""

SEND_QUESTION_TEXT = """
لطفا متن سوال خود را بنویسید:

⚠️ حداکثر تعدا کاراکتر برای متن سوال **{} کاراکتر** است.
⚠️ در صورت نیاز پس از ثبت سوال میتوانید فایل های مورد نیاز را نیز به سوال پیوست کنید.

📌 میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

NO_EMPTY_TEXT = """
❌ متن سوال نمیتواند خالی باشد.

لطفا مجدد متن سوال را ارسال کنید:
"""

TEXT_LENGTH_LIMIT = """
❌ حداکثر تعدا کاراکتر برای متن سوال **{} کاراکتر** است.

لطفا مجدد متن سوال را ارسال کنید:
"""

NEW_QUESTION_SUBMITTED = """
سوال جدیدی توسط یکی از کاربران در ربات ثبت شده است (/question_detail_{}).
"""
