MAX_ATTACHMENT_NUMBER = """
هر سوال حداکثر میتواند **{} فایل** به عنوان پیوست داشته باشد.

📌 متاسفانه در صورتی که وجود این پیوست ضروری است شما باید یکی از پیوست های قبلی را برای افزودن پیوست جدید حذف کنید.
"""

SEND_FILE = """
لطفا با توجه به محدودیت های زیر فایل خود را ارسال کنید:

🖼️ فایل عکس با حداکثر حجم **{} مگابایت**
🎥 فایل ویدیویی با حداکثر حجم **{} مگابایت**
🎵 فایل صوتی (یا وویس) با حداکثر حجم **{} مگابایت**

📌 شما میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

ATTACH_FILE_CANCELED = "پیوست کردن فایل به سوال کنسل شد."

ATTACH_FILE_SUCCESSFUL = "✅ فایل مورد نظر با موفقیت به سوال شما پیوست شد."
