MAX_ATTACHMENT_NUMBER = """
هر سوال حداکثر میتواند **{} فایل** به عنوان پیوست داشته باشد.

📌 متاسفانه در صورتی که وجود این پیوست ضروری است شما باید یکی از پیوست های قبلی را برای افزودن پیوست جدید حذف کنید.
"""

SEND_FILE = """
لطفا فایل مورد نظر خود را ارسال کنید:

⚠️ محدودیتی در ارسال فایل های مختلف (🖼️🎥🎵) ندارید.
⚠️ میتوانید برای فایل خود توضیحات (کپشن) نیز بنویسید.

📌 میتوانید این فرآیند را کنسل (/cancel) کنید.
"""

ATTACH_FILE_CANCELED = "پیوست کردن فایل به سوال کنسل شد."

FILE_IS_REQUIRED = "❌ شما باید حتما یک فایل ارسال کنید:"

ATTACH_FILE_SUCCESSFUL = "✅ فایل مورد نظر با موفقیت به سوال شما پیوست شد."
